using UnityEngine;
using System.Collections;

public class nabe : MonoBehaviour {

    // メンバ変数
    //--------------------------------------------------------------------
    [SerializeField]
    private string[] tags;	// 鍋に入れた材料の配列


    // 初期化
    //--------------------------------------------------------------------
    void Start () {
	
	}

    // update
    //--------------------------------------------------------------------
    void Update () {
	
	}

    // 離したときに材料を追加するための衝突処理
    //--------------------------------------------------------------------
    void OnCollisionEnter2D(Collision2D collision)
    {
        // TODO 衝突している、かつフリック操作が”離している”フラグが立っている時のみ判定
        //if( FlickOut(適当な変数名) == true )
        //{
        // 衝突したオブジェクトが材料ならば、タグを追加する
            
        //}
    }
}
